/* Learn more label text */
"<b>Learn more</b> about device management and security." = "<b>Aflaţi mai multe</b> despre managementul şi securitatea dispozitivului.";

/* No comment provided by engineer. */
"A system error occurred" = "S-a produs o eroare de sistem";

/* Account will be removed on this device at SSO Page */
"Account will be removed from %@ and other Yahoo apps on this device." = "Contul va fi eliminat din %@ şi din alte aplicaţiile Yahoo de pe acest dispozitiv.";

/* Add Account cell in SSO Screen - Allows user to Sign-In as new user */
"Add Account" = "Adăugare cont";

/* No comment provided by engineer. */
"An error occurred. Please try again later." = "S-a produs o eroare. Încercaţi din nou mai târziu.";

/* Accessibility label for the back button */
"Back" = "Înapoi";

/* call tip prefix in 2lc */
"Call %@" = "Apelare %@";

/* No comment provided by engineer. */
"Call again" = "Apelare din nou";

/* Cancel
   Cancel button title */
"Cancel" = "Anulare";

/* Fallback page cannot be loaded. */
"Cannot load page." = "Nu se poate încărca pagina.";

/* Accessibility label for the close button */
"Close" = "Închidere";

/* Continue to Safari for SHF */
"Continue" = "Continuare";

/* Create Account view title
   sign up button title */
"Create Account" = "Creare cont";

/* learn more alert title */
"Device Not Recognized" = "Dispozitiv nerecunoscut";

/* No comment provided by engineer. */
"Didn't receive the email?" = "Nu aţi primit e-mailul?";

/* No comment provided by engineer. */
"Didn't receive the text message?" = "Nu aţi primit mesajul text?";

/* No comment provided by engineer. */
"Didn't receive the voice call?" = "Nu aţi primit apelul vocal?";

/* Dismiss */
"Dismiss" = "Renunţare";

/* Edit button title */
"Edit" = "Editare";

/* No comment provided by engineer. */
"Email could not be sent" = "E-mailul nu a putut fi trimis";

/* No comment provided by engineer. */
"Email sent" = "E-mail trimis";

/* No comment provided by engineer. */
"Enter Code" = "Introducere cod";

/* For security reasons you need to verify your account or need to change password when SHF */
"For security reasons you need to unlock your account." = "Din motive de securitate, trebuie să vă deblocaţi contul.";

/* Switching to alternative sign-in interface. */
"For security reasons, please verify your account again." = "Din motive de siguranţă, vă rugăm să vă reverificaţi contul.";

/* forgot password or ID title
   Sign in alert view title */
"Forgot password or ID?" = "Aţi uitat ID-ul sau parola?";

/* forgot password title
   Sign in alert view title */
"Forgot password?" = "Aţi uitat parola?";

/* Go to Account recovery */
"Get Help" = "Obţineţi ajutor";

/* No comment provided by engineer. */
"Incorrect answer. Try again." = "Răspuns incorect. Încercaţi din nou.";

/* No comment provided by engineer. */
"Invalid ID or password. Please try again." = "ID sau parolă incorecte. Încercaţi din nou.";

/* No comment provided by engineer. */
"Limit reached. Email could not be sent." = "Limită atinsă. E-mailul nu a putut fi trimis.";

/* No comment provided by engineer. */
"Limit reached. Unable to send text message or make a voice call." = "Limită atinsă. Nu se poate trimite mesajul text sau nu se poate efectua apelul vocal.";

/* 2LC Failure
   Login session has expired, please try again. */
"Login session has expired, please try again." = "Sesiunea a expirat. Încercaţi din nou.";

/* Network error alert view title */
"Network unavailable." = "Reţea indisponibilă.";

/* OK
   OK Button title
   ok button title */
"OK" = "OK";

/* password text field place holder */
"Password" = "Parola";

/* 2LC password prompt str */
"Please enter your password for \n%@" = "Introduceţi parola pentru \n%@";

/* Remove the account
   SSO remove account title */
"Remove" = "Eliminare";

/* Remove an account label on SSO screen */
"Remove an account" = "Eliminare cont";

/* Select an account label on SSO screen */
"Select an account" = "Selectaţi un cont";

/* account token invalid sign in problem */
"Session expired, please sign-in again." = "Sesiune expirată; vă rugăm să vă autentificaţi din nou.";

/* sign in button title */
"Sign In" = "Autentificare";

/* 3PA Label */
"Sign in with <a>Facebook</a> or <b>Google</b>" = "Autentificarea cu <a>Facebook</a> sau <b>Google</b>";

/* Zero tap alert signed in as */
"Signed in as" = "V-aţi conectat ca";

/* signing in state title for sign in button */
"Signing In" = "Autentificarea";

/* No comment provided by engineer. */
"Sorry, the system is down. Please try again later." = "Ne pare rău, sistemul este oprit. Încercaţi din nou mai târziu.";

/* No comment provided by engineer. */
"Sorry, we can't sign you in now. Please try again later." = "Ne pare rău, nu vă putem autentifica în acest moment. Încercaţi din nou mai târziu.";

/* sms tip prefix in 2lc */
"Text %@" = "Text %@";

/* No comment provided by engineer. */
"Text message could not be sent" = "Mesajul text nu a putut fi trimis";

/* No comment provided by engineer. */
"Text message sent" = "Mesaj text trimis";

/* No comment provided by engineer. */
"The Second Challenge state data could not be extracted from the Short-Lived Challenge Credential" = "Datele privind a doua solicitare nu au putut fi extrase din Acreditivul de solicitare de scurtă durată";

/* Second Login Challenge Error - user entered the code wrong too many times. */
"Too many attempts. Try again in 24 hours." = "Prea multe încercări. Încercaţi din nou peste 24 de ore.";

/* No comment provided by engineer. */
"Try again" = "Încercaţi din nou";

/* No comment provided by engineer. */
"Unable to place a voice call" = "Nu se poate efectua apelul vocal";

/* SSL Certificate Error - Please Check Date/Time */
"Unable to sign in. Check system date and try again." = "Autentificare eşuată. Verificaţi data sistemului şi reîncercaţi.";

/* Token handoff failure */
"Unable to sign in. Please try again." = "Conectare eşuată.  Vă rugăm să încercaţi din nou. ";

/* Unlock */
"Unlock" = "Deblocare";

/* unlock account view title */
"Unlock Your Account" = "Deblocare cont";

/* Create Account view title
   View title - appears in the navigation \
                                                                                                                    bar containing the webview that displays the account upgrade flow */
"Update Account" = "Actualizare de cont";

/* Migrate 3PA Account view title */
"Upgrade to Yahoo" = "Faceţi upgrade la Yahoo";

/* User already signed-in */
"User already signed-in" = "Utilizator deja autentificat";

/* User already signed-in */
"User %d is already signed in" = "User %d is already signed in";

/* 2LC aea verify prompt text
   2LC sms verify prompt text */
"Verification code sent to %@" = "Cod de verificare trimis la %@";

/* No comment provided by engineer. */
"Voice call in progress" = "Apel vocal în curs de desfăşurare";

/* 2LC voice verify prompt text */
"We called you with a verification code at %@" = "V-am apelat pentru a vă trimite un cod de verificare la %@";

/* No comment provided by engineer. */
"We do not recognize this device. Please verify your identity by answering your security question." = "Nu recunoaştem acest dispozitiv. Confirmaţi-vă identitatea răspunzând la întrebarea de securitate.";

/* No comment provided by engineer. */
"We do not recognize this device. Please verify your identity. We will send a verification code." = "Nu recunoaştem acest dispozitiv. Verificaţi-vă identitatea. Vă vom trimite un cod de verificare.";

/* ID text field place holder */
"Yahoo ID" = "ID Yahoo";

/* No comment provided by engineer. */
"You must be at least 13 years old." = "Trebuie să aveţi cel puţin 13 ani.";

/* No comment provided by engineer. */
"Your account is locked." = "Contul dvs. este blocat.";

/* Unlock success */
"Your account is now unlocked. Please sign in." = "Contul dvs. este acum deblocat. Autentificaţi-vă.";

/* No comment provided by engineer. */
"Your Answer" = "Răspunsul dvs.";

/* learn more alert msg line 1 */
"• New device?" = "• Dispozitiv nou?";

/* learn more alert msg line 3 */
"• Opted for sign in verification?" = "• Aţi optat pentru verificare la autentificare?";

/* learn more alert msg line 2 */
"• Signing in from a new country?" = "• Vă autentificaţi dintr-o ţară nouă?";

/* Yahoo Messenger */
"Messenger" = "Messenger";